app/controllers/holidays_controller.rb

  def index
     if current_user.admin == true
        respond_to do |format|
        format.html
        format.xml { render :xml => @holidays }
        format.atom
        format.js { render :partial => @holidays }
        @holidays = Holiday.all.paginate(:page => params[:page], :per_page => 8)
        end
     else
        respond_to do |format|
        format.html
        format.xml { render :xml => @holidays }
        format.atom
        format.js { render :partial => @holidays }
        @holidays = Holiday.find_all_by_user_id(current_user.id).paginate(:page => params[:page], :per_page => 8)
---
SELECT * FROM "holidays"
SELECT * FROM "holidays" WHERE ("holidays"."user_id" = 7)

  def show
    @holiday = Holiday.find(params[:id])
---
SELECT * FROM "holidays" WHERE ("holidays"."id" = 1)

  def create
    @holiday = Holiday.new(params[:holiday])
    @holiday.user_id = current_user.id
    if @holiday.save
---
INSERT INTO "holidays" ("number_of_days", "created_at", "date_to", "updated_at", "date_from", "approved", "user_id") VALUES(2.0, '2012-01-23 18:41:34', '2012-01-23', '2012-01-23 18:41:34', '2012-01-23', NULL, 7)

  def edit
    @holiday = Holiday.find(params[:id])
---
SELECT * FROM "holidays" WHERE ("holidays"."id" = 3)

  def update
    @holiday = Holiday.find(params[:id])
    if @holiday.update_attributes(params[:holiday])
---
SELECT * FROM "holidays" WHERE ("holidays"."id" = 42)
UPDATE "holidays" SET "updated_at" = '2012-04-10 18:16:01', "photo_file_name" = '285944_10150266639822393_512777392_7566674_6547262_o.jpg', "photo_file_size" = 575283, "photo_updated_at" = '2012-04-10 18:16:00' WHERE "id" = 14

  def destroy
    @holiday = Holiday.find(params[:id])
    @holiday.destroy
---
SELECT * FROM "holidays" WHERE ("holidays"."id" = 3)
DELETE FROM "holidays" WHERE "id" = 3